# 1) for - სინტაქსის შემადგყენელი keyword(ნაწილი)
# 2) i - ცვლადის დასახელება(i - აეის სტანდარტული სახელი)
# 3) in - სინტაქსის შემადგენელი keyword(ნაწილი)
# 4) range() - გამოიტანოს კონტენტი იმდენჯერ რამდენიც ჩაწერილია რკალურ ფრჩხილებში - ეს არის რკალური ფრჩხილები - ()
# 5) : - სინტაქსის შემადგენელი ნაწილი 

for i in 'GOA BEST!':
    print('hello')


# range() - მოიცავს 3 პარამეტრს
# 1) საიდან დაიწყოს ათვლა 
# 2) სადამდე გაგრძელდეს
# 3) რამდენით გადადგას ნაბიჯი


for i in range(5, 60, 4):
    print(i)


# While loop

# Differences 

# 1) Syntax 
# 2) purpose
# 3) flexvility


while 5 > 3 and 2 < 12:
    print("+")


